Revit 2024 API
BuiltInFailures.SketchFailures.TrussShiftedReferences Property
 Truss top and bottom references (chains of one or more reference lines) must overlap at least partially in the vertical direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TrussShiftedReferences { get; }
Visual Basic
Public Shared ReadOnly Property TrussShiftedReferences As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TrussShiftedReferences {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace